import os
import numpy as np
from PIL import Image, ImageFont, ImageDraw


def outText(keyTxt):
    nLen = len(keyTxt)
    if nLen < 1:
        return

    img = Image.new("RGB", (nLen * 18, 26), (255, 255, 255))

    img = img.convert('RGBA')

    arr = np.array(np.asarray(img))
    r, g, b, a = np.rollaxis(arr, axis=-1)
    mask = ((r > 100)
            & (g > 100)
            & (b > 100)
            & (np.abs(r - g) < 5)
            & (np.abs(r - b) < 5)
            & (np.abs(g - b) < 5)
            )
    arr[mask, 3] = 0
    img = Image.fromarray(arr, mode='RGBA')

    dr = ImageDraw.Draw(img)
    font = ImageFont.truetype(os.path.join("fonts", "STXIHEI.TTF"), 16)
    dr.text((5, 5), keyTxt, font=font, fill="#000000")

    img.save(keyTxt + '.png')


if __name__ == '__main__':
    strText = u'重要性,紧迫性,自觉性,主动性,坚定性,民族性,时代性,实践性,全局性,前瞻性,战略性,积极性,' \
              u'创造性,长期性,复杂性,艰巨性,可讲性,鼓动性,计划性,敏锐性,规范化,制度化,程序化,集约化,正常化,' \
              u'有序化,智能化,优质化,常态化,科学化,热心,耐心,诚心,决心,红心,真心,公心,铁心,上心,用心,童心,' \
              u'好心,专心,忠心,大局意识,忧患意识,责任意识,法律意识,廉洁意识,学习意识,上进意识,管理意识,出发点,' \
              u'切入点,落脚点,着眼点,结合点,关键点,着重点,着力点,根本点,活动力,控制力,影响力,创造力,凝聚力' \
              u'找准出发点,把握切入点,明确落脚点,找准落脚点,抓住切入点,把握着重点,找准切入点,把握着力点,抓好落脚点,' \
              u'不动摇,不放弃,不改变,不妥协,是历史的必然,现实的选择,未来的方向,立足当前,着眼长远,重点,分步骤,全面推进,' \
              u'统筹兼顾,综合治理,融入全过程,贯穿各方面,切实抓好,严格执行,坚决制止,明确职责,高举旗帜,坚定不移,' \
              u'牢牢把握,积极争取,深入开展,注重强化,规范,改进,积极发展,努力建设,依法实行,良性互动,优势互补,率先发展,' \
              u'互惠互利,做细,做实,全面分析,全面贯彻,持续推进,全面落实,实施,一抓到底,爱岗敬业,求真务实,胸怀全局,' \
              u'拓宽视野,中国人不惹事,但也不怕事,用不着美国佬来说三道四,美国就是搅屎棍,美国就是万恶之源,' \
              u'爱我中华，祖国雄起！犯我中华者，虽远必诛！,看美国横行到几时！,帝国主义亡我之心不死,点赞！,祖国发展真是快！转脸进入大时代。,' \
              u'重视国家创新发展战略，习总书记高瞻远瞩,不错,又向诺贝尔奖登上了一步！,日本人的话也信？,日本就是个不负责任的政府,' \
              u'以美国为首的反华势力亡我之心不死,我们要坚定捍卫国家主权，捍卫国家统一，以雷霆之势打击敌人,要叫美帝疼到心里,' \
              u'把美国的阴谋诡计戳穿,要团结一切可以团结的力量,不断探索出一条正确的发展道路,立足当前，着眼长远，自觉按规律办事,有重点,' \
              u'分步骤,全面推进,统筹兼顾,综合治理,融入全过程,扎实推进,加快发展,持续增收,积极稳妥,落实,从严控制,实现新提升,实现新提高,' \
              u'实现新跨越,实现新突破,实现新发展,实现新改善,取得新改善,取得新成绩,取得新突破,取得新成果,取得新成效,取得新进展,取得新胜利,' \
              u'得到新加强,得到新改善,迎来新突破,呈现新气象,形成新骨架,汇聚新动能,展示新风貌,展现新风采,开创新局面,迈上新台阶,迈出新步伐,' \
              u'新时代标注发展方位,新矛盾校正前进方向,新思想凝聚磅礴力量,新征程擘画未来蓝图,新使命激荡奋斗热情,新时代,新起点,' \
              u'必须以新思想来指引,必须贯彻新发展理念,必须开辟新路径,必须有新认识,必须培育新动能,必须创造新生活,必须有新作为,统一思想,' \
              u'提高认识,明确目标,团结奋进,团结拼搏,克难而进,攻坚克难,积极参与,高度重视,认真组织,精心部署,总揽全局,协调各方,高举旗帜,服从大局,' \
              u'加强学习,提升能力,求真务实,提高效能,发扬民主,增进团结,抢抓机遇,开拓创新,坚定信心,转变作风,凝心聚力,同心同德,齐心协力,' \
              u'步调一致,解放思想,实事求是,锤炼作风,狠抓落实,敢于创新,迎难而上,紧扣重点,奋力推进,正视差距,准确把握,与时俱进,强化保障,' \
              u'加强领导,全力支持,恪尽职守,尽职尽责,勤勉工作,不负重托,不辱使命,认清形势,振奋精神,围绕中心,主动作为,锐意进取,扎实工作,' \
              u'全力以赴,吃透精神,把握精髓,未雨绸缪,突出重点,统筹兼顾,集中精力,新时代呼唤新担当，新时代需要新作为，站上一个新的起点，迈向一个新的高度,' \
              u'发展为了人民,发展依靠人民,发展成果由人民共享,团结起来，振兴中华,爱我们的民族,应该处处为国家着想,爱国是义务，是一种光荣,' \
              u'坚定理想信念，练就过硬本领，勇于创新创造，矢志艰苦奋斗，锻炼高尚品格，追逐青春理想,经济形势在好转,,闯出一片新天地,铸就一份新辉煌，' \
              u'强大的祖国,英明领导,中华民族伟大复兴,人民幸福,祝愿祖国繁荣昌盛！,美帝国主义者是纸老虎,扎扎实实落实好,工作是为了人民群众,' \
              u'高举新时代旗帜,祖国都是坚强的后盾,感谢强大的祖国,祖国太强大了,从此走向繁荣富强,谣言都别信！,可能是谣言,践行网络文明,严惩造谣者,抵制网络谣言,' \
              u'美方抹黑中国,反对一切反华势力,赢了,太伟大了,抗日抗美,我们又赢了！,可能是境外势力,'

    listText = strText.split(',')
    for txt in listText:
        outText(txt)
